Revit 2027 API
ModelCurveArray.Item Property
Gets or sets a model curve at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ModelCurve this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As ModelCurve
	Get
	Set
public:
virtual property ModelCurve^ Item[int index] {
	ModelCurve^ get (int index);
	void set (int index, ModelCurve^ value);
}
abstract Item : ModelCurve with get, set
override Item : ModelCurve with get, set
Parameters
index Int32
The index of the model curve to be set or retrieved.
Return Value
ModelCurve
Returns the model curve at the specified index.
See Also
Reference
ModelCurveArray Class
Autodesk.Revit.DB Namespace